const NAMES = ['Вячеслав', 'Эвелина', 'Анастасия', 'Максим', 'Артём', 'Евгений', 'Елена', 'Екатерина', 'Павел', 'Арсений', 'Эмилия', 'Егор'];

const DESCRIPTIONS = [
  'Все только начинает становиться действительно хорошим.',
  'Сегодня я проснулась вот так ? А вы ?',
  'Я никогда ничего не теряю. Я либо побеждаю, либо узнаю что-то новое.',
  'Выходные, пожалуйста, не оставляйте меня сейчас!',
  'Мне нравится и улыбаюсь!',
  'Я просто увидел самого умного человека в мире, когда смотрел в зеркало.' ];

const MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!' ];

const Avatar = {
  MIN: 1,
  MAX: 6
};

const Likes = {
  MIN: 15,
  MAX: 200
};

const CountComment = {
  MIN: 0,
  MAX: 23
};

const MAX_PHOTO = 25;

const MAX_RENDER_COMMENTS = 5;

const MAX_HASHTAGS_COUNT = 5;
const MAX_HASHTAGS_LENGTH = 20;
const MAX_DESCRIPTION_LENGTH = 140;

export { NAMES, DESCRIPTIONS, MESSAGES, Avatar, Likes, MAX_PHOTO, CountComment, MAX_HASHTAGS_COUNT, MAX_HASHTAGS_LENGTH, MAX_DESCRIPTION_LENGTH, MAX_RENDER_COMMENTS };
